"Selling my 1999 Chevrolet C5 Magnetic Red Corvette convertible with No Reserve!  Clean CarFax!  The car has a 6 speed transmission, light oak leather power seats with memory, heads–up display, and Bose sound system with a 12 disk CD changer.  The car has aftermarket ZR1 chrome wheels and I still have the original wagon wheels. Also, the car has a newer black convertible top.  This is a beautiful non-smoker car.\nI bought this car in 2015 at 32,276 miles and it currently has 36,860 miles so I put only 4,584 miles since I bought it.  I believe I am the third owner.  I bought the car from a collector who owned it since 1999 and he bought the car with only 8,085 miles.  He was in his 60’s and a non-smoker and I am 59 and a non-smoker. He kept the car stored indoors with his other cars.  I keep the car in a garage and the car looks like it has been well cared for all of its life.  The car comes with a California Car Cover (embroidered with the previous owner’s name) and a Battery Tender for storage.\nI have documentation for this Corvette from all the way back when the previous owner who bought the car in 1999.\nI am selling the car to free up some cash, to simplify my life, and due to lack of use.  Both me and my wife are both employed working in essential businesses.  I take care of my toys. If you look at my other auctions, you will see I am selling other toys due to lack of use.  \nThis car is in excellent condition for being a 21 year old survivor.  I would categorize it as a really nice driver.  We only used it on weekends and vacation driving it on nice dry days.  It has the power of a 70’s muscle car but the benefits of a luxury car.  Plus, I get +30 miles per gallon on the highway in 6th gear when I am easy on the gas.  When I was younger, I had a big block Nova, a Cutlass 442, and a couple Trans Am’s which included a 1976 Golden Anniversary Black Trans Am with a 455 and 4 speed manual.  This Corvette outperforms all of those cars. Plus, it handles and stops great which the older cars with drum brakes did not.  This is why you see so many of those older muscle cars being converted to resto-mods with Corvette suspensions and drive trains."